app/controllers/clients_controller.rb

INSERT INTO `clients` (`name`, `created_at`, `updated_at`, `user_id`, `description`) VALUES('client1', '2010-08-02 08:46:55', '2010-08-02 08:46:55', 1, 'client1 desc')
---
  def create
     @client= current_user.clients.new(params[:client])#Client.new(params[:client])
#      @client.user_id=current_user.id
    if @client.save

SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
DELETE FROM `clients` WHERE `id` = 1
---
  def destroy
     @client=Client.find(params[:id])
    if @client.destroy

SELECT * FROM `clients` WHERE (`clients`.`id` = 4)
UPDATE `clients` SET `updated_at` = '2010-08-03 13:53:52', `description` = 'bbbbbbbbbbb' WHERE `id` = 4
---
  def update
    @client = Client.find(params[:element_id])
    if (params[:original_value]==@client.name)
      if @client.update_attribute(:name, params[:update_value])