app/controllers/members_controller.rb

  def index
     @users=User.find(:all,:conditions => ["AdminId = '#{current_user.id}'"])
---
SELECT * FROM `users` WHERE (`users`.`id` = 11) LIMIT 1

  def invited
  @invitation=current_user.invitations.new(params[:member])
  if @invitation.save
---
INSERT INTO `invitations` (`created_at`, `updated_at`, `user_id`, `email`) VALUES('2010-08-06 09:38:44', '2010-08-06 09:38:44', 23, 'aaaaaaa@fdd.vom')

  def assigned_tasks
    #@tasks=Member.find(:all,:conditions=>["user_id= ?", current_user.id])
    @tasks=Task.find(:all,:conditions=>["user_id= ?" && Task::Project::user_id !='#{current_user.id}','#{current_user.id}'])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `tasks` WHERE (`tasks`.user_id = 2)

  def destroy
    @member=User.find(params[:id])
    if @member.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 2