app/controllers/projects_controller.rb

INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `user_id`, `client`, `description`) VALUES('project 1', '2010-08-02 09:20:02', '2010-08-02 09:20:02', 1, 'client1', 'desc project 1')
---
    def create
      @project=current_user.projects.new(params[:project])
      if @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 5)
UPDATE `projects` SET `updated_at` = '2010-08-03 14:10:09', `name` = 'wwwwwwwwwwwww', `description` = 'qqqqqqqqqqqqqqq' WHERE `id` = 5
---
   def update
    @project=Project.find(params[:id])
    if @project.update_attributes(params[:project])

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
DELETE FROM `projects` WHERE `id` = 1
---
  def destroy
     @project=Project.find(params[:id])
    if @project.destroy