app/controllers/tasks_controller.rb

  def edit
    @task=Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)

  def create
     @task=Task.new(params[:task])
     @task.user_id=params[:members][:user_id]
    if @task.save
---
INSERT INTO `members` (`task_id`, `created_at`, `member_id`, `updated_at`) VALUES(21, '2010-08-09 14:43:40', 28, '2010-08-09 14:43:40')
INSERT INTO `tasks` (`name`, `duration`, `created_at`, `project_id`, `updated_at`, `member`, `user_id`, `description`) VALUES('task1', 2, '2010-08-02 14:02:06', 1, '2010-08-02 14:02:06', NULL, NULL, 'dsfsdfsdfs')

  def update
    @task=Task.find(params[:id])
    if @task.update_attributes(params[:task])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)
UPDATE `tasks` SET `updated_at` = '2010-08-03 14:18:24', `name` = 'bbbbbbbbbbbbbbbb', `duration` = 2, `description` = 'mmmmmmmmmmmmmmmmmmmmmm' WHERE `id` = 9

  def destroy
     @task=Task.find(params[:id])
      if @task.destroy
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 4)
DELETE FROM `tasks` WHERE `id` = 4

  def save_time
puts params[:disp]
puts params[:id]
@task=Task.find(params[:id])
@old=@task.time
puts @old
@task.time=params[:disp]
if @task.save
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 35 AND (`tasks`.user_id = 1))
UPDATE `tasks` SET `updated_at` = '2010-08-12 14:33:25', `time` = '2000-01-01 00:00:01' WHERE `id` = 35

  def show
    @task=Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)