app/controllers/users_controller.rb

SELECT * FROM `invitations` WHERE (`invitations`.`id` = 23)
---
  def new
    @user = User.new
    unless params[:val].blank?
      @invitation =Invitation.find(params[:val])

SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'aaaaaaa@fdd.com' AND `users`.id <> 33) LIMIT 1
SELECT * FROM `invitations` WHERE (`invitations`.`id` = 2)
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `admin_id`, `remember_token`, `login`, `roles`, `email`) VALUES('', '0aa6e1644ee171cd132034fd285ecbbf9813d179', '2010-08-06 10:40:44', 'a9ff69f123c96370cc949111541f617871ec1d04', NULL, '2010-08-06 10:40:44', NULL, NULL, 'eeeeee', NULL, 'hai@dfgd.com')
SELECT count(*) AS count_all FROM `users`
---
  def create
    logout_keeping_session!
    puts params[:user][:email_value]
    @user = User.new(params[:user])
    if !params[:user][:email_value].blank?
      @invitation =Invitation.find(params[:user][:email_value])
       @user.roles = '1'
       @user.AdminId = @invitation.user_id
       #@user.AdminId = params[:AdminId]
      else
        @user.roles = '0'
       end
    success = @user && @user.save
    if success && @user.errors.empty?